espressif/esp-iot-solution/components/display/tools/esp_lv_lottie_player/test_apps/lvgl9/sdkconfig.defaults
# For IDF 5.0
CONFIG_ESP_TASK_WDT_EN=n

CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_IDF_TARGET="esp32s3"

# PSRAM configuration (required for lottie player)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
